co-expression#*(1)
co-expression#*(1)
co-expression#*(1)
&null
list#*(9)
list#*(9)
&null
&null
1
"abc"
'a'
co-expression#*(0)
procedure io.write
table#*(0)
record array#*(7)
failed
co-expression#*(0)
1
2
3
co-expression#*(0)
1
2
3
4
5
6
7
8
9
10
failed
failed
failed
failed
10
10
"co-expression#*(10)"
co-expression#*(0)
co-expression#*(0)
entering trim
entering abs
1
2
co-expression#*(2)
co-expression#*(2)
2
coexpr.icn   :   58  | dummy(co-expression#101(0),co-expression#102(0),co-expression#103(0),co-expression#104(0),&null)
coexpr.icn   :    6  | dummy suspended co-expression#101(0)
coexpr.icn   :   59  | dummy(&null,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended &null
coexpr.icn   :   60  | dummy("co-expression#10...",&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended "co-expression#10..."
coexpr.icn   :   61  | dummy(0,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended 0
coexpr.icn   :   62  | dummy("list#55(0)",&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended "list#55(0)"
coexpr.icn   :   63  | dummy(3,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended 3
coexpr.icn   :   64  | dummy(1,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended 1
coexpr.icn   :   65  | dummy("\"function image\"",&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended "\"function image\""
in cx write 1
return value 1
in cx write 2
return value 2
in cx write 3
return value 3
in cx write 4
return value 4
