co-expression#*
co-expression#*
co-expression#*
&null
list#*(9)
list#*(9)
&null
&null
1
"abc"
'a'
co-expression#*
procedure io.write
table#*(0)
record array#*(7)
failed
co-expression#*
1
2
3
co-expression#*
1
2
3
4
5
6
7
8
9
10
failed
failed
failed
failed
"co-expression#*"
co-expression#*
co-expression#*
entering trim
entering abs
1
2
co-expression#*
co-expression#*
2
coexpr.icn   :   58  | dummy(co-expression#101,co-expression#102,co-expression#103,co-expression#104,&null)
coexpr.icn   :    6  | dummy suspended co-expression#101
coexpr.icn   :   59  | dummy(&null,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended &null
coexpr.icn   :   60  | dummy("co-expression#105",&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended "co-expression#105"
coexpr.icn   :   62  | dummy("list#103(0)",&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended "list#103(0)"
coexpr.icn   :   63  | dummy(3,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended 3
coexpr.icn   :   64  | dummy(1,&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended 1
coexpr.icn   :   65  | dummy("\"function image\"",&null,&null,&null,&null)
coexpr.icn   :    6  | dummy suspended "\"function image\""
in cx write 1
return value 1
in cx write 2
return value 2
in cx write 3
return value 3
in cx write 4
return value 4
